# ActiveAddInId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..ActiveAddInId Property
Application Class See Also
---
Retrieves the Id of the currently running external application.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public AddInId ActiveAddInId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ActiveAddInId As AddInId
	Get
```

Visual C++
---
```text
public:
property AddInId^ ActiveAddInId {
	AddInId^ get ();
}
```

# Remarks
The application can be either a UI application, DB application, or an external command. If no addin is active, this property will return nullNothingnullptra null reference (Nothing in Visual Basic). If an event handler is currently being executed, the returned value will be the Id of the application or command in which the event handler was registered.
# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace